In [1]:
import numpy as np
import pandas as pd

In [4]:
sozlukverisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmır":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukverisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
havaDurumuDataFrame.dropna(axis=0)

   Istanbul  Ankara  Izmır
0      30.0    20.0     40

In [10]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
havaDurumuDataFrame.dropna(axis=1)

   Izmır
0     40
1     39
2     38

In [14]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmır":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [15]:
yeniDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [16]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [17]:
yeniDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [18]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [19]:
yeniDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

## Groupy

In [27]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan ismi":["Ahmet","Hasan","Mehmet","Burak","Faruk","Kemal"],
              "Maas":[100,150,200,250,300,350]}

In [28]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [29]:
maasDataFrame

   Departman Calisan ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım        Hasan   150
2  Pazarlama       Mehmet   200
3  Pazarlama        Burak   250
4      Hukuk        Faruk   300
5      Hukuk        Kemal   350

In [47]:
grupObjesi=maasDataFrame.groupby("Departman")

In [54]:
list(grupObjesi)

[('Hukuk',
    Departman Calisan ismi  Maas
  4     Hukuk        Faruk   300
  5     Hukuk        Kemal   350),
 ('Pazarlama',
     Departman Calisan ismi  Maas
  2  Pazarlama       Mehmet   200
  3  Pazarlama        Burak   250),
 ('Yazılım',
    Departman Calisan ismi  Maas
  0   Yazılım        Ahmet   100
  1   Yazılım        Hasan   150)]

In [42]:
grupObjesi.count()

           Calisan ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [43]:
grupObjesi.mean()

C:\Users\Hasan Özcan\AppData\Local\Temp\ipykernel_13380\104408460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean()

            Maas
Departman
Hukuk      325.0
Pazarlama  225.0
Yazılım    125.0

In [44]:
grupObjesi.min()

          Calisan ismi  Maas
Departman
Hukuk            Faruk   300
Pazarlama        Burak   200
Yazılım          Ahmet   100

In [45]:
grupObjesi.max()

          Calisan ismi  Maas
Departman
Hukuk            Kemal   350
Pazarlama       Mehmet   250
Yazılım          Hasan   150

In [48]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  325.0  35.355339  300.0  312.5  325.0  337.5  350.0
Pazarlama   2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0